# Parameters
nc: 80
scale: n
scales:
  n: [0.50, 0.25, 1024]  # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024]  # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512]   # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512]   # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # Lớp sử dụng
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
#
#  # Lớp giả
#  - [-1, 1, nn.Identity, []]   # 4
#  - [-1, 1, nn.Identity, []]   # 5
#  - [-1, 1, nn.Identity, []]   # 6
#  - [-1, 1, nn.Identity, []]   # 7
#  - [-1, 1, nn.Identity, []]   # 8
#  - [-1, 1, nn.Identity, []]   # 9
#  - [-1, 1, nn.Identity, []]   # 10
#
## YOLO11n head
head:
#  - [-1, 1, nn.Identity, []]   # 11
#  - [-1, 1, nn.Identity, []]   # 12 (thay cho Concat)
#  - [-1, 1, nn.Identity, []]   # 13
#  - [-1, 1, nn.Identity, []]   # 14
#  - [-1, 1, nn.Identity, []]   # 15 (thay cho Concat)
#  - [-1, 1, nn.Identity, []]   # 16
#  - [-1, 1, nn.Identity, []]   # 17
#  - [-1, 1, nn.Identity, []]   # 18 (thay cho Concat)
#  - [-1, 1, nn.Identity, []]   # 19
#  - [-1, 1, nn.Identity, []]   # 20
#  - [-1, 1, nn.Identity, []]   # 21 (thay cho Concat)
#  - [-1, 1, nn.Identity, []]   # 22
#
#  # Giữ lại lớp Detect và trỏ nó vào các lớp Identity
#  # Điều này có thể gây lỗi vì Detect mong đợi các kênh cụ thể.
#  # Cách tốt nhất là trỏ Detect vào lớp cuối cùng có thật.
#  - []
  - [[3], 1, Detect, [nc]] # Trỏ Detect vào lớp 3 để tránh lỗi